Revit 2027 API
LightGroupManager.IsLightOn Method
 Returns true if the given light is on for rendering the given view
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLightOn(
	ElementId viewId,
	ElementId lightId
)
Public Function IsLightOn (
	viewId As ElementId,
	lightId As ElementId
) As Boolean
public:
bool IsLightOn(
	ElementId^ viewId,
	ElementId^ lightId
)
member IsLightOn :
        viewId : ElementId *
        lightId : ElementId -> bool
Parameters
viewId ElementId
 The Id of the view
lightId ElementId
 The Id of the light
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light instance
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace